import random
import time

from rich.console import Console
from rich.prompt import Prompt

from moneytracker.core.services.user_service import UserService
from moneytracker.infrastructure.dependencies import manage_uow
from moneytracker.tui.pages.menu import MenuPage
from moneytracker.tui.pages.sign_up import SignUpPage
from moneytracker.tui.utils import DASHBOARD_TAB, Page, clear_screen

user_service = UserService()


welcome_vect = []
welcome_vect.append(
    """
░██       ░██ ░██████████ ░██           ░██████    ░██████   ░███     ░███ ░██████████ 
░██       ░██ ░██         ░██          ░██   ░██  ░██   ░██  ░████   ░████ ░██         
░██  ░██  ░██ ░██         ░██         ░██        ░██     ░██ ░██░██ ░██░██ ░██         
░██ ░████ ░██ ░█████████  ░██         ░██        ░██     ░██ ░██ ░████ ░██ ░█████████  
░██░██ ░██░██ ░██         ░██         ░██        ░██     ░██ ░██  ░██  ░██ ░██         
░████   ░████ ░██         ░██          ░██   ░██  ░██   ░██  ░██       ░██ ░██         
░███     ░███ ░██████████ ░██████████   ░██████    ░██████   ░██       ░██ ░██████████ 
                                                                                       
                                                                                       

"""
)

welcome_vect.append(
    """
██╗    ██╗███████╗██╗      ██████╗ ██████╗ ███╗   ███╗███████╗
██║    ██║██╔════╝██║     ██╔════╝██╔═══██╗████╗ ████║██╔════╝
██║ █╗ ██║█████╗  ██║     ██║     ██║   ██║██╔████╔██║█████╗  
██║███╗██║██╔══╝  ██║     ██║     ██║   ██║██║╚██╔╝██║██╔══╝  
╚███╔███╔╝███████╗███████╗╚██████╗╚██████╔╝██║ ╚═╝ ██║███████╗
 ╚══╝╚══╝ ╚══════╝╚══════╝ ╚═════╝ ╚═════╝ ╚═╝     ╚═╝╚══════╝

"""
)

welcome_vect.append(
    """
 █     █░▓█████  ██▓     ▄████▄   ▒█████   ███▄ ▄███▓▓█████ 
▓█░ █ ░█░▓█   ▀ ▓██▒    ▒██▀ ▀█  ▒██▒  ██▒▓██▒▀█▀ ██▒▓█   ▀ 
▒█░ █ ░█ ▒███   ▒██░    ▒▓█    ▄ ▒██░  ██▒▓██    ▓██░▒███   
░█░ █ ░█ ▒▓█  ▄ ▒██░    ▒▓▓▄ ▄██▒▒██   ██░▒██    ▒██ ▒▓█  ▄ 
░░██▒██▓ ░▒████▒░██████▒▒ ▓███▀ ░░ ████▓▒░▒██▒   ░██▒░▒████▒
░ ▓░▒ ▒  ░░ ▒░ ░░ ▒░▓  ░░ ░▒ ▒  ░░ ▒░▒░▒░ ░ ▒░   ░  ░░░ ▒░ ░
  ▒ ░ ░   ░ ░  ░░ ░ ▒  ░  ░  ▒     ░ ▒ ▒░ ░  ░      ░ ░ ░  ░
  ░   ░     ░     ░ ░   ░        ░ ░ ░ ▒  ░      ░      ░   
    ░       ░  ░    ░  ░░ ░          ░ ░         ░      ░  ░
                        ░                                   
    """
)

welcome_vect.append(
    """
 █████   ███   █████ ██████████ █████         █████████     ███████    ██████   ██████ ██████████
▒▒███   ▒███  ▒▒███ ▒▒███▒▒▒▒▒█▒▒███         ███▒▒▒▒▒███  ███▒▒▒▒▒███ ▒▒██████ ██████ ▒▒███▒▒▒▒▒█
 ▒███   ▒███   ▒███  ▒███  █ ▒  ▒███        ███     ▒▒▒  ███     ▒▒███ ▒███▒█████▒███  ▒███  █ ▒ 
 ▒███   ▒███   ▒███  ▒██████    ▒███       ▒███         ▒███      ▒███ ▒███▒▒███ ▒███  ▒██████   
 ▒▒███  █████  ███   ▒███▒▒█    ▒███       ▒███         ▒███      ▒███ ▒███ ▒▒▒  ▒███  ▒███▒▒█   
  ▒▒▒█████▒█████▒    ▒███ ▒   █ ▒███      █▒▒███     ███▒▒███     ███  ▒███      ▒███  ▒███ ▒   █
    ▒▒███ ▒▒███      ██████████ ███████████ ▒▒█████████  ▒▒▒███████▒   █████     █████ ██████████
     ▒▒▒   ▒▒▒      ▒▒▒▒▒▒▒▒▒▒ ▒▒▒▒▒▒▒▒▒▒▒   ▒▒▒▒▒▒▒▒▒     ▒▒▒▒▒▒▒    ▒▒▒▒▒     ▒▒▒▒▒ ▒▒▒▒▒▒▒▒▒▒ 
                                                                                                 
                                                                                                 
                                                                                                 
    """
)

welcome_vect.append(
    """
$$\\      $$\\ $$$$$$$$\\ $$\\       $$$$$$\\   $$$$$$\\  $$\\      $$\\ $$$$$$$$\\ 
$$ | $\\  $$ |$$  _____|$$ |     $$  __$$\\ $$  __$$\\ $$$\\    $$$ |$$  _____|
$$ |$$$\\ $$ |$$ |      $$ |     $$ /  \\__|$$ /  $$ |$$$$\\  $$$$ |$$ |      
$$ $$ $$\\$$ |$$$$$\\    $$ |     $$ |      $$ |  $$ |$$\\$$\\$$ $$ |$$$$$\\    
$$$$  _$$$$ |$$  __|   $$ |     $$ |      $$ |  $$ |$$ \\$$$  $$ |$$  __|   
$$$  / \\$$$ |$$ |      $$ |     $$ |  $$\\ $$ |  $$ |$$ |\\$  /$$ |$$ |      
$$  /   \\$$ |$$$$$$$$\\ $$$$$$$$\\\\$$$$$$  | $$$$$$  |$$ | \\_/ $$ |$$$$$$$$\\ 
\\__/     \\__|\\________|\\________|\\______/  \\______/ \\__|     \\__|\\________|
                                                                           
                                                                           
                                                                                                                                  
    """
)


class LoginPage(Page):
    def show(self, console: Console) -> Page:
        first = True

        while True:
            clear_screen()

            welcome = random.choice(welcome_vect)

            console.print(f"[bold blue]{welcome}[/]")
            # console.print("[bold cyan]--- Welcome ---[/bold cyan]")

            console.print("l. Login")
            console.print("s. Sign Up")
            console.print("[yellow]q. Quit[/yellow]")

            if not first:
                console.print("[red]Wrong username or password[/red]")
            else:
                first = False

            choice = Prompt.ask("\nEnter your choice", choices=["l", "s", "q"], default="l")

            if choice == "l":
                console.print("\n--- Login ---")

                username = Prompt.ask("Username")
                password = Prompt.ask("Password", password=True)

                with manage_uow() as uow:
                    user = user_service.authenticate(uow, username, password)

                if user is not None:
                    return MenuPage(user.id, DASHBOARD_TAB)

            elif choice == "s":
                return SignUpPage()

            elif choice == "q":
                console.print("[bold red]Exiting...[/bold red]")
                time.sleep(0.5)
                return None
